# Analyzing NYC public school test result scores

## I. Introduction

In [1]:
from IPython.display import HTML

html_content = """
<p><img src="https://imageio.forbes.com/specials-images/imageserve/640a3239b5c903c3207aa269/Page-from-SAT-test-preparation-book/960x0.jpg?format=jpg&width=1440" alt="SAT exam" height="350px" width="350px"></p>
<p><i>Photo by Thomas A.</i></p>
<br></p>
<p>Annually, American high schoolers take the SATs to assessing their skills in math, reading, and writing, with each section scoring up to 800 points. This exam plays a vital role for college admissions as these tests inform stakeholders like educators, researchers, and parents about student's school performances.</p>
<p>In this notebook, we will explore SAT data from public schools throughout New York City, contained within a singular database table named 'schools'.</p>
<h3 id="schools">schools</h3>
<table>
<thead>
<tr>
<th>column</th>
<th>type</th>
<th>description</th>
</tr>
</thead>
<tbody>
<tr>
<td>school_name</td>
<td>varchar</td>
<td>Name of school</td>
</tr>
<tr>
<td>borough</td>
<td>varchar</td>
<td>Borough that the school is located in</td>
</tr>
<tr>
<td>building_code</td>
<td>varchar</td>
<td>Code for the building</td>
</tr>
<tr>
<td>average_math</td>
<td>int</td>
<td>Average math score for SATs</td>
</tr>
<tr>
<td>average_reading</td>
<td>int</td>
<td>Average reading score for SATs</td>
</tr>
<tr>
<td>average_writing</td>
<td>int</td>
<td>Average writing score for SATs</td>
</tr>
<tr>
<td>percent_tested</td>
<td>numeric</td>
<td>Percentage of students completing SATs</td>
</tr>
</tbody>
</table>
"""

display(HTML(html_content))

## II. Data Exploration

In [2]:
import pandas as pd
import sqlite3

In [3]:
df = pd.read_csv('schools_modified.csv')

In [4]:
# Establish a connection to the database, this will create the database file if it does not exist
conn = sqlite3.connect('schools_modified.db')

# Write the data to a table in the database
df.to_sql('schools', conn, if_exists='replace', index=False)

# Close the connection
conn.close()

In [5]:
%load_ext sql

In [6]:
%sql sqlite:///schools_modified.db

In [19]:
%%sql

SELECT *
FROM schools
LIMIT 10

 * sqlite:///schools_modified.db
Done.

[('New Explorations into Science, Technology and Math High School', 'Manhattan', 'M022', 657, 601, 601, None),
 ('Essex Street Academy', 'Manhattan', 'M445', 395, 411, 387, 78.9),
 ('Lower Manhattan Arts Academy', 'Manhattan', 'M445', 418, 428, 415, 65.1),
 ('High School for Dual Language and Asian Studies', 'Manhattan', 'M445', 613, 453, 463, 95.9),
 ('Henry Street School for International Studies', 'Manhattan', 'M056', 410, 406, 381, 59.7),
 ('Bard High School Early College', 'Manhattan', 'M097', 634, 641, 639, 70.8),
 ('Urban Assembly Academy of Government and Law', 'Manhattan', 'M445', 389, 395, 381, 80.8),
 ('Marta Valle High School', 'Manhattan', 'M025', 438, 413, 394, 35.6),
 ('University Neighborhood High School', 'Manhattan', 'M446', 437, 355, 352, 69.9),
 ('New Design High School', 'Manhattan', 'M445', 381, 396, 372, 73.7)]

***Note:** It appears that there are a few missing values in the percent_tested column.*

### 1. How many schools did not report `percent_tested` information?

In [8]:
%%sql 

SELECT COUNT(*) - COUNT(percent_tested) as num_missing_percent, 
COUNT(*) as num_schools
FROM schools

 * sqlite:///schools_modified.db
Done.

[(20, 375)]

There are 20 schools with missing `percent_tested` value, which accounting for just 5% of our database.

### 2. Which schools are best/worst in each of the three subjectsâ€”math, reading, and writing?

#### Top 5 schools by average Math score:

In [9]:
%%sql 

SELECT school_name, average_math FROM schools 
ORDER BY average_math DESC 
LIMIT 5

 * sqlite:///schools_modified.db
Done.

[('Stuyvesant High School', 754),
 ('Bronx High School of Science', 714),
 ('Staten Island Technical High School', 711),
 ('Queens High School for the Sciences at York College', 701),
 ('High School for Mathematics, Science, and Engineering at City College', 683)]

#### Bottom 5 schools by average Math score:

In [10]:
%%sql 

SELECT school_name, average_math FROM schools 
ORDER BY average_math ASC 
LIMIT 5

 * sqlite:///schools_modified.db
Done.

[('Pan American International High School at Monroe', 317),
 ('Multicultural High School', 319),
 ('W. H. Maxwell Career and Technical Education High School', 326),
 ('Dr. Susan S. McKinney Secondary School of the Arts', 332),
 ('Pan American International High School', 340)]

#### Top 5 schools by average Reading score:

In [11]:
%%sql 

SELECT school_name, average_reading FROM schools 
ORDER BY average_reading DESC 
LIMIT 5

 * sqlite:///schools_modified.db
Done.

[('Stuyvesant High School', 697),
 ('High School of American Studies at Lehman College', 672),
 ('Staten Island Technical High School', 660),
 ('Bronx High School of Science', 660),
 ('Bard High School Early College', 641)]

#### Bottom 5 schools by average Reading score:

In [12]:
%%sql 

SELECT school_name, average_reading FROM schools 
ORDER BY average_reading ASC 
LIMIT 5

 * sqlite:///schools_modified.db
Done.

[('International High School at Prospect Heights', 302),
 ('Kingsbridge International High School', 311),
 ('Pan American International High School at Monroe', 315),
 ('Pan American International High School', 320),
 ('Multicultural High School', 323)]

#### Top 5 schools by average Writing score:

In [13]:
%%sql 

SELECT school_name, average_writing FROM schools 
ORDER BY average_writing DESC 
LIMIT 5

 * sqlite:///schools_modified.db
Done.

[('Stuyvesant High School', 693),
 ('High School of American Studies at Lehman College', 672),
 ('Staten Island Technical High School', 670),
 ('Bronx High School of Science', 667),
 ('Townsend Harris High School', 661)]

#### Bottom 5 schools by average Writing score:

In [14]:
%%sql 

SELECT school_name, average_writing FROM schools 
ORDER BY average_writing ASC 
LIMIT 5

 * sqlite:///schools_modified.db
Done.

[('Multicultural High School', 284),
 ('Pan American International High School at Monroe', 292),
 ('International High School at Prospect Heights', 300),
 ('Kingsbridge International High School', 310),
 ('International Community High School', 312)]

### 3. Which are the top 10 schools by average total scores?

In [15]:
%%sql 

SELECT school_name,
       (average_math + average_reading + average_writing) AS total_score
FROM schools
ORDER BY total_score DESC
LIMIT 10

 * sqlite:///schools_modified.db
Done.

[('Stuyvesant High School', 2144),
 ('Staten Island Technical High School', 2041),
 ('Bronx High School of Science', 2041),
 ('High School of American Studies at Lehman College', 2013),
 ('Townsend Harris High School', 1981),
 ('Queens High School for the Sciences at York College', 1947),
 ('Bard High School Early College', 1914),
 ('Brooklyn Technical High School', 1896),
 ('Eleanor Roosevelt High School', 1889),
 ('High School for Mathematics, Science, and Engineering at City College', 1889)]

### 4. How the test performance varies by borough?

In [16]:
%%sql 

SELECT borough,
       ROUND(AVG(average_math), 1) AS avg_math_score,
       ROUND(AVG(average_reading), 1) AS avg_reading_score,
       ROUND(AVG(average_writing), 1) AS avg_writing_score,
       ROUND(AVG(average_math + average_reading + average_writing), 1) AS total_avg_score
FROM schools
GROUP BY borough
ORDER BY total_avg_score DESC

 * sqlite:///schools_modified.db
Done.

[('Staten Island', 486.2, 478.5, 474.3, 1439.0),
 ('Queens', 462.4, 443.3, 439.9, 1345.5),
 ('Manhattan', 455.9, 444.9, 439.3, 1340.1),
 ('Brooklyn', 416.4, 410.8, 403.1, 1230.3),
 ('Bronx', 404.4, 402.5, 395.8, 1202.7)]

### 5. How many schools in each borough have an average total score above the city-wide average?

In [17]:
%%sql 

SELECT borough, 
       COUNT(*) AS num_above_city_avg
FROM schools
WHERE (average_math + average_reading + average_writing) > 
    (SELECT AVG(average_math + average_reading + average_writing) FROM schools)
GROUP BY borough
ORDER BY num_above_city_avg DESC

 * sqlite:///schools_modified.db
Done.

[('Manhattan', 45),
 ('Queens', 39),
 ('Brooklyn', 30),
 ('Bronx', 16),
 ('Staten Island', 9)]

### 6. What is the average total score for schools with above 70% tested, compared to schools with 70% or below?

In [18]:
%%sql

SELECT
  ROUND(AVG(CASE WHEN percent_tested > 70 THEN (average_math + average_reading + average_writing) END), 1) AS avg_score_above_70,
  ROUND(AVG(CASE WHEN percent_tested <= 70 OR percent_tested IS NULL THEN (average_math + average_reading + average_writing) END), 1) AS avg_score_70_or_below
FROM schools

 * sqlite:///schools_modified.db
Done.

[(1400.2, 1196.7)]